; domain
; IPC5 Domain: TPP Propositional
; Authors: Alfonso Gerevini and Alessandro Saetti 

(define (domain TPP-Propositional)
(:requirements :strips :typing)
(:types place locatable level - object
	depot room - place
	robot box - locatable)

(:predicates (loaded ?g - box ?t - robot ?l - level)
	     (ready-to-load ?g - box ?m - room ?l - level) 
	     (stored ?g - box ?l - level) 
	     (ready-to-offload ?g - box ?m -  room ?l - level)
	     (next ?l1 ?l2 - level)
	     (at ?t - robot ?p - place)
	     (connected ?p1 ?p2 - place))

(:action move
 :parameters (?t - robot ?from ?to - place)
 :precondition (and (at ?t ?from) (connected ?from ?to))
 :effect (and (not (at ?t ?from)) (at ?t ?to)))


; ### LOAD ###
; ?l1 is the level of ?g ready to be loaded at ?m before loading
; ?l2 is the level of ?g ready to be loaded at ?m after loading
; ?l3 is the level of ?g in ?t before loading
; ?l4 is the level of ?g in ?t after loading

(:action pick-up
 :parameters (?g - box ?t - robot ?m - room ?l1 ?l2 ?l3 ?l4 - level)
 :precondition (and (at ?t ?m) (loaded ?g ?t ?l3)
		    (ready-to-load ?g ?m ?l2) (next ?l2 ?l1) (next ?l4 ?l3))
 :effect (and (loaded ?g ?t ?l4) (not (loaded ?g ?t ?l3)) 
	      (ready-to-load ?g ?m ?l1) (not (ready-to-load ?g ?m ?l2))))


; ### UNLOAD ###
; ?l1 is the level of ?g in ?t before unloading
; ?l2 is the level of ?g in ?t after unloading
; ?l3 is the level of ?g in ?d before unloading
; ?l4 is the level of ?g in ?d after unloading

(:action put-down
 :parameters (?g - box ?t - robot ?d - depot ?l1 ?l2 ?l3 ?l4 - level)
 :precondition (and (at ?t ?d) (loaded ?g ?t ?l2)
		    (stored ?g ?l3) (next ?l2 ?l1) (next ?l4 ?l3))
 :effect (and (loaded ?g ?t ?l1) (not (loaded ?g ?t ?l2)) 
	      (stored ?g ?l4) (not (stored ?g ?l3))))


; ### BUY ###
; ?l1 is the level of ?g on sale at ?m before buying
; ?l2 is the level of ?g on sale at ?m after buying 
; ?l3 is the level of ?g ready to be loaded at ?m before buying
; ?l4 is the level of ?g ready to be loaded at ?m after buying

(:action locate-box
 :parameters (?t - robot ?g - box ?m - room ?l1 ?l2 ?l3 ?l4 - level)
 :precondition (and (at ?t ?m) (ready-to-offload ?g ?m ?l2) (ready-to-load ?g ?m ?l3)
		    (next ?l2 ?l1) (next ?l4 ?l3))
 :effect (and (ready-to-offload ?g ?m ?l1) (not (ready-to-offload ?g ?m ?l2)) 
	      (ready-to-load ?g ?m ?l4) (not (ready-to-load ?g ?m ?l3))))

)

; problem
(define (problem TPP)
(:domain TPP-Propositional)
(:objects
	box1 box2 box3 - box
	robot1 - robot
	room1 room2 room3 - room
	depot1 - depot
	level0 level1 - level)

(:init
	(next level1 level0)
	(ready-to-load box1 room1 level0)
	(ready-to-load box2 room2 level0)
	(ready-to-load box3 room3 level0)
	(stored box1 level0)
	(stored box2 level0)
	(stored box3 level0)
	(loaded box1 robot1 level0)
	(loaded box2 robot1 level0)
	(loaded box3 robot1 level0)
	(connected depot1 room1)
	(connected room1 depot1)
	(connected depot1 room2)
	(connected room2 depot1)
	(connected depot1 room3)
	(connected room3 depot1)
	(ready-to-offload box1 room1 level1)
	(ready-to-offload box2 room2 level1)
	(ready-to-offload box3 room3 level1)
	(at robot1 depot1))

(:goal (and
	(stored box1 level1)
	(stored box2 level1)
	(stored box3 level1)))

)

; plan
1. (move robot1 depot1 room3)
   deleted: (at robot1 depot1)
   added: (at robot1 room3)
   goals met: 0 of 3
2. (locate-box robot1 box3 room3 level0 level1 level0 level1)
   deleted: (ready-to-offload box3 room3 level1) (ready-to-load box3 room3 level0)
   added: (ready-to-offload box3 room3 level0) (ready-to-load box3 room3 level1)
   goals met: 0 of 3
3. (pick-up box3 robot1 room3 level0 level1 level0 level1)
   deleted: (loaded box3 robot1 level0) (ready-to-load box3 room3 level1)
   added: (loaded box3 robot1 level1) (ready-to-load box3 room3 level0)
   goals met: 0 of 3
4. (move robot1 room3 depot1)
   deleted: (at robot1 room3)
   added: (at robot1 depot1)
   goals met: 0 of 3
5. (put-down box3 robot1 depot1 level0 level1 level0 level1)
   deleted: (loaded box3 robot1 level1) (stored box3 level0)
   added: (loaded box3 robot1 level0) (stored box3 level1)
   goals met: 1 of 3
6. (move robot1 depot1 room2)
   deleted: (at robot1 depot1)
   added: (at robot1 room2)
   goals met: 1 of 3
7. (locate-box robot1 box2 room2 level0 level1 level0 level1)
   deleted: (ready-to-offload box2 room2 level1) (ready-to-load box2 room2 level0)
   added: (ready-to-offload box2 room2 level0) (ready-to-load box2 room2 level1)
   goals met: 1 of 3
8. (pick-up box2 robot1 room2 level0 level1 level0 level1)
   deleted: (loaded box2 robot1 level0) (ready-to-load box2 room2 level1)
   added: (loaded box2 robot1 level1) (ready-to-load box2 room2 level0)
   goals met: 1 of 3
9. (move robot1 room2 depot1)
   deleted: (at robot1 room2)
   added: (at robot1 depot1)
   goals met: 1 of 3
10. (put-down box2 robot1 depot1 level0 level1 level0 level1)
   deleted: (loaded box2 robot1 level1) (stored box2 level0)
   added: (loaded box2 robot1 level0) (stored box2 level1)
   goals met: 2 of 3
11. (move robot1 depot1 room1)
   deleted: (at robot1 depot1)
   added: (at robot1 room1)
   goals met: 2 of 3
12. (locate-box robot1 box1 room1 level0 level1 level0 level1)
   deleted: (ready-to-offload box1 room1 level1) (ready-to-load box1 room1 level0)
   added: (ready-to-offload box1 room1 level0) (ready-to-load box1 room1 level1)
   goals met: 2 of 3
13. (pick-up box1 robot1 room1 level0 level1 level0 level1)
   deleted: (loaded box1 robot1 level0) (ready-to-load box1 room1 level1)
   added: (loaded box1 robot1 level1) (ready-to-load box1 room1 level0)
   goals met: 2 of 3
14. (move robot1 room1 depot1)
   deleted: (at robot1 room1)
   added: (at robot1 depot1)
   goals met: 2 of 3
15. (put-down box1 robot1 depot1 level0 level1 level0 level1)
   deleted: (loaded box1 robot1 level1) (stored box1 level0)
   added: (loaded box1 robot1 level0) (stored box1 level1)
   goals met: 3 of 3
